app/Http/Livewire/Terms.php

    function addSession()
    {
        $data = $this->validate([
            'name' => ['required', 'unique:years,name', 'starts_with:20', new SessionRule],
            'start' => 'required|date',
            'end' => 'required|date|after:start',
        ]);

        $saved = Year::create($data);
---
insert into "years" ("session_name", "session_start", "session_end", "is_current", "updated_at", "created_at") values ('2015/17', '2023-08-06', '2023-08-06', 1, '2023-07-16 02:02:01', '2023-07-16 02:02:01')

    function addTerm()
    {

        $data = $this->validate([
            'name' => ['required'],
            'start' => 'required|date',
            'end' => 'required|date|after:start',
            'dso' => 'nullable|integer',
        ]);

        $terms = Term::where('year_id', $this->year_id)->pluck('name')->toArray();
        if (count($terms) === 3) {
            $this->alert('error', 'Maximum mumber of term reach');
        } elseif (in_array($data['name'], $terms)) {
            $this->alert('warning', 'Duplicate Term, term already existed');
        } else {
            $saved = Term::create(array_merge(['year_id' => $this->year_id], $data));
            if ($saved) {
                $this->reset();
                $year = Year::find($saved->year_id);
---
select "name" from "terms" where "year_id" = 4 and "terms"."deleted_at" is null
insert into "terms" ("year_id", "name", "start", "end", "dso", "updated_at", "created_at") values (4, 'first', '2023-07-14 00:00:00', '2023-07-22 00:00:00', '110', '2023-07-16 02:36:47', '2023-07-16 02:36:47')
select * from "years" where "years"."id" = 4 and "years"."deleted_at" is null limit 1

    function updateTerm()
    {
        $data = $this->validate([
            'name' => ['required'],
            'start' => 'required|date',
            'end' => 'required|date|after:start',
            'dso' => 'nullable|integer',
        ]);

        $update = Term::find($this->cid)->update($data);
        $yearId = $this->year_id;
        if ($update) {
            $this->reset();
            $year = Year::find($yearId);
---
select * from "terms" where "terms"."id" = 6 and "terms"."deleted_at" is null limit 1
update "terms" set "name" = 'second', "start" = '2023-02-03 00:00:00', "end" = '2024-05-16 00:00:00', "dso" = '102', "updated_at" = '2023-07-16 02:12:46' where "id" = 6
select * from "years" where "years"."id" = 2 and "years"."deleted_at" is null limit 1

    function lastTerm()
    {
        return Term::orderByDesc('id')->first();
---
select * from "terms" where "terms"."deleted_at" is null order by "id" desc limit 1

    public function delete()
    {

        $term = Term::findOrFail($this->cid);
        $true = $term->delete();
        $yearId = $term->year_id;

        if ($true) {
            $this->reset();
            $year = Year::find($yearId);
---
select * from "years" where "years"."id" = 10 and "years"."deleted_at" is null limit 1

    function mount()
    {
        $cur = currentSession();
        if ($cur) {
            $this->activeSession = $cur;
            $this->year_id = $cur->id;
            $this->terms = Term::where('year_id', $cur->id)->latest()->get();
---
select * from "terms" where "year_id" = 4 and "terms"."deleted_at" is null order by "created_at" desc

    public function render()
    {
        $currentSessionTerms = $this->activeSession ? $this->activeSession->terms : [];
        $term = "%$this->search%";
        $years = Year::where('name', 'LIKE', $term)->latest()->simplePaginate($this->perPage);
---
select * from "years" where "name" LIKE '%%' and "years"."deleted_at" is null order by "created_at" desc limit 5 offset 0