app/Http/Livewire/Terms.php

    function updateTerm()
    {
        $data = $this->validate([
            'name' => ['required'],
            'start' => 'required|date',
            'end' => 'required|date|after:start',
            'dso' => 'nullable|integer',
        ]);
        $terms = Term::where('year_id', $this->year_id)->pluck('name')->toArray();
---
select "name" from "terms" where "year_id" = 2 and "terms"."deleted_at" is null

    public function deleteSession(Year $year)
    {
        $del = $year->delete();
---
update "years" set "deleted_at" = '2023-07-16 02:05:04', "updated_at" = '2023-07-16 02:05:04' where "id" = 10

    function mount()
    {
        $cur = currentSession();
        if ($cur) {
            $this->activeSession = $cur;
            $this->year_id = $cur->id;
            $this->terms = Term::where('year_id', $cur->id)->latest()->get();
---
select * from "terms" where "terms"."year_id" = 2 and "terms"."year_id" is not null and "terms"."deleted_at" is null