app/Helpers/helpers.php

function currentSession(): object|null
{
 $term = \App\Models\Year::where('is_current', true)->first();
---
select * from "years" where "is_current" = 1 and "years"."deleted_at" is null limit 1

function currentTerm(): object|null
{
 $terms = \App\Models\Term::get();
 return $terms->count() ? \App\Models\Term::with(['year:id,session_name'])->latest()->first() : null;
---
select * from "terms" where "terms"."deleted_at" is null
select "id", "session_name" from "years" where "years"."id" in (1) and "years"."deleted_at" is null
select * from "terms" where "terms"."deleted_at" is null order by "created_at" desc limit 1