app/Models/Term.php

update "terms" set "is_current" = 0, "updated_at" = '2023-07-16 02:36:47' where "terms"."deleted_at" is null
---
    static function boot()
    {
        parent::boot();

        self::created(function ($model) {
            Term::query()->update(['is_current' => false]);