app/Models/Year.php

update "years" set "is_current" = 0, "updated_at" = '2023-07-16 02:02:01' where "years"."deleted_at" is null
select * from "years" where "years"."deleted_at" is null order by "id" desc limit 1
update "years" set "is_current" = 1, "updated_at" = '2023-07-16 02:09:02' where "id" = 1
---
    static function boot()
    {
        parent::boot();

        // make all the session current to first and make the recent one to be true
        self::creating(function ($model) {
            Year::query()->update(['is_current' => false]);
            $model->is_current = true;
            // $model->tenant_id = true;
        });


        // after deletion of current session make the last one the current session
        self::deleted(function () {
            $year = Year::query()->orderByDesc('id')->first();
            if ($year) {
                $year->update(['is_current' => true]);
            }
        });